{
    "title": "Alibaba Anti-trust Dispute: Lessons from its Conclusion",
    "date": "2024-02-10",
    "content": ["Alibaba is a Chinese multinational company that operates one of the world’s largest e-commerce platforms and has increasingly become a focal point of scrutiny and controversies. Beginning in 2012, complaints raised by merchants brought into public attention the business practices of Tianmao (now Tmall), one of the Business-to-Consumer (B2C) platforms of Alibaba. Merchants alleged that Alibaba imposed contractual conditions requiring them to deal exclusively on its platform. This practice would later be termed as “pick-one-from-two” policy. These arrangements were embedded in private contracts, but their economic effect was to restrict merchants from simultaneously participate in rival platforms, thereby impeding competition in China’s rapidly expanding digital marketplace.",
    "As Alibaba’s platform expanded beyond domestic retail into cross-border commerce, logistics, and digital payments, the consequences of these exclusive agreements became increasingly international in character. Foreign sellers using Alibaba in order to access Chinese market, as well as Chinese merchants engaging in international trade, find their commercial freedom restrained by platforms like Alibaba. This situation presents a rising conflict within international commercial law: the delicate balance between the freedom to contract and the need for government oversight. This is especially true when standard-form contracts, created by a powerful platform, have a significant impact on global trade.",
    "The legal battle involving Alibaba came to its pinnacle when China's State Administration for Market Regulation (SAMR) formally began antitrust proceedings. The case was resolved on April 10, 2021, resulting in a $2.78 billion fine—the largest ever levied in a Chinese antitrust case. SAMR determined that Alibaba had misused its dominant market position by forcing merchants into exclusivity agreements, thus breaching competition law. While the decision was taken under domestic antitrust legislation, its consequences extend well beyond national boundaries. Given Alibaba’s role as an intermediary facilitation international sales contracts, the ruling indirectly reshaped contractual relationship between buyers, sellers, logistics providers, and payment intermediaries engaged in cross-border trade.",
    "From the perspective of international law, this case is an illustration to how dominance in digital marketplaces can undermine the element of consent associated with contracts, by binding merchants involuntarily. Merchants technically agreed to exclusivity clauses, yet the absence of viable alternatives raised serious questions about unequal bargaining power. In international commercial transactions, parties often rely on standardized platform terms rather than negotiated agreements, this dispute demonstrates how competition law can operate as a corrective mechanism to restore equal bargaining power in contracts.",
    "The controversy also revealed important implications for the carriage of goods in international commerce. Cainiao, logistics infrastructure of Alibaba, allowed it to influence shipping arrangements, delivery priorities, and access to logistical services. By tying platform access with exclusivity, Alibaba may indirectly affect the conditions under which goods were transported across borders, raising concerns about non-discriminatory access to logistics network. This intersection between competition law and carriage of goods underscores how marketplace dominance can reshape global supply chains without directly owning the goods transported.",
    "Equally significant are the implications for international payment systems. Alibaba Group’s ecosystem includes digital payment services that facilitate cross-border transactions, blurring the line between marketplace, and financial intermediary. Although the antitrust proceedings did not directly target payment operations, the case certainly demonstrates how vertical agreements can amplify market dominance across multiple stages of an international transaction, affecting payment choices, and transaction costs. Payment processors play an important role in international transactions, therefore their role being neutral and unbiased is of highest importance. As was in a 2025 controversy of Visa, Mastercard, and PayPal, where they enforced pressure upon Steam, a video game distribution service to remove games that “violate the standards of payment processors, card networks, or internet providers,” raising concerns over censorship. This case further adds to the Alibaba dispute on how international commerce can be indirectly influenced by dominant players in critical roles.",
    "Finally, the manner in which the Alibaba dispute was resolved highlights the growing role of public regulatory authorities in areas traditionally governed by alternate dispute resolution. Unlike conventional international commercial disputes that have been resolved through arbitration or litigation, the Alibaba case was addressed through administrative enforcement, emphasizing that certain forms of market conduct are treated as matters of public economic order. For international commercial law, this marked an important shift: even in transactions governed by private contracts and arbitration clauses, state intervention may reshape commercial relationships where competition and market access are at stake."
    ]
}